/**
 * 生成名单
 */
function getRollCall() {
	//	var arr_personnel = new Array();
	// 生成52个名单
	//	for(var i = 0; i < 26; i += 1) {
	//		arr_personnel.push(String.fromCharCode(65 + i)); //输出A-Z  26个大写字母
	//		arr_personnel.push(String.fromCharCode(97 + i)); //输出a-z  26个小写字母
	//	}
	var arr_personnel = new Array('杨怡伶', '林亚蓉', '李家伟', '陈皓茜', '杨郁婷', '张旺茹', '李彦志', '张雅玫',
		'郭育维', '吴兰木', '江松兰', '吴淑霞', '许育海', '赖雅婷', '谢宜恩', '储世昌', '张雅泰', '周左达',
		'林馨仪', '史怡静', '苏思翰', '赵美绍', '黄崇舜', '杨季生', '陈一柏', '杨信宏', '叶忠翰', '林子竹',
		'黄千倩', '蔡冠宇', '张玉萍', '丁宜芳', '谢伟元', '林婉婷', '刘冠良', '侯盈如', '王薇宣', '臧杰良',
		'陈雅惠', '叶依婷', '黄美惠', '赖雅娇', '林志扬', '陈建霖', '张东兰', '杨怡静', '刘慧君', '蔡美慧',
		'林宁平', '吴天琪', '周凯翔', '刘竹娥', '陈文军', '林舜琬', '郑威德', '林丰善', '方淑馨', '林佳颖',
		'林盈薇', '张凯绍', '伍湖琴', '陈佳霖', '丁志明', '许晓雯', '郑忠琴', '杜湖怡', '林怡君', '林慧顺',
		'赖建谕', '涂正珍', '林晏娥', '冯晴瑄', '孙宣玮', '黄淑中', '黎雅铃', '黄毓书', '涂亭淑', '张喜娟',
		'林懿名', '蔡嘉莲', '王靖宣', '曹雅芬', '吴盈秀', '黄欣洁', '谢倩维', '梁平宁', '林姿美', '张世竹',
		'黄诗昀', '侯秉琳', '蔡行均', '郑兆书', '胡元珠', '蔡坤昆', '宋瑶帆', '何嘉惠', '夏怡静', '陈玟霞',
		'黄崇帆', '曾台云', '张怡洁', '张永任', '曾怡婷', '许镇霖', '洪伟哲', '林雅婷', '黄雅婷', '桂淑惠',
		'许宏伟', '黄佳慧', '袁宜君', '曾珍瑜', '许玉婷', '李珍莲', '王伟汉', '黄冠芸', '张瑞琴', '罗骏英',
		'蔡宝梅', '魏良桂', '褚彦君', '张怡君', '张书爱', '郭家良', '陈培馨', '黄丽安', '王思瑄', '宋淑珍',
		'吴佩容', '黄重佩', '张忆南', '吴尧东', '李国荣', '刘宗毅', '陈玮纯', '符静裕', '杨雅玲', '叶郁婷',
		'吴雅芳', '蔡启昆', '梁静宜', '谢文馨', '林雅帆', '李家凡', '林木光', '陈家珠', '岑威廷', '林义廷',
		'游宥依', '叶百香', '李月纶', '陈建乐', '潘志婷', '萧惠萍');
	
	return arr_personnel;
}

/**
 * 随机点名
 */
function randomRollCall() {
	var arr = getRollCall();
	var rollCall = new Array();
	for(var i = 0; i < 20; i += 1) {
		//获取随机数
		var index = parseInt(Math.random() * arr.length)
		//splice - 根据下标开始删除几个数,并返回删除对象
		//参数一:是下标,参数二:删除几个数
		rollCall.push(arr.splice(index, 1));
	}
	return rollCall;
}

/**
 * 显示名单
 */
function displayName() {
	document.getElementById('nameList').innerHTML = "<strong>人员名单:</strong>" + randomRollCall();
}
